Tekla.Structures.Model.UI.GraphicPolyLine


Tekla.Structures.Model.UI.GraphicPolyLine.PolyLine
The path of the line.

Tekla.Structures.Model.UI.GraphicPolyLine.Color
The line color.

Tekla.Structures.Model.UI.GraphicPolyLine.Width
The line width in pixels.
NOTE: Currently the valid width values are 1, 2 and 4

Tekla.Structures.Model.UI.GraphicPolyLine.Type
The appearance of the line. For instance solid, dashed or dotted.

Tekla.Structures.Model.UI.GraphicPolyLine.#ctor
Create a black line with width 1 and solid line type.

Tekla.Structures.Model.UI.GraphicPolyLine.#ctor(Tekla.Structures.Model.UI.Color,System.Int32,Tekla.Structures.Model.UI.GraphicPolyLine.LineType)
Create a graphic polyline object with 0 points.
color: The color of the line.
width: The width of the line.
type: The type of the line. For example solid, dashed or dotted.

Tekla.Structures.Model.UI.GraphicPolyLine.#ctor(Tekla.Structures.Geometry3d.PolyLine,Tekla.Structures.Model.UI.Color,System.Int32,Tekla.Structures.Model.UI.GraphicPolyLine.LineType)
Create a graphic polyline object.
polyLine: The path of the line.
color: The color of the line.
width: The width of the line.
type: The type of the line. For example solid, dashed or dotted.

Tekla.Structures.Model.UI.GraphicPolyLine.ToStruct(Tekla.Structures.ModelInternal.dotGraphicPolyLine_t@)
graphicPolyLine:

Tekla.Structures.Model.UI.GraphicPolyLine.FromStruct(Tekla.Structures.ModelInternal.dotGraphicPolyLine_t@)
graphicPolyLine: